Courses/4420/Lectures/Refreshers/Makefile/index.org

# -*- mode: org -*-
#+date: 2018-12-03
#+TITLE: Refresher on Makefiles
#+AUTHOR: Prabhaker Mateti
#+HTML_LINK_HOME: ../../Top/index.html
#+HTML_LINK_UP: ../
#+HTML_HEAD: <style> P,li {text-align: justify} code {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a> | <a href=./>NoSlides</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2018 <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> &bull; %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:0

* Targeted Goal

1.  [[./Makefile-linux-4.20]]  for Linux Kernel + Modules
1. [[./Makefile-selinux-devel-include]] for building a SELinux .pp 
1. Understand the two examples above "quite well"


* What is in a Makefile?

1. Dependencies
1. String Definitions
1. Shell Commands
1. Example Makefile for the above:  [[../TurnInSrc/Makefile]]

* Practical Details

1. Different design/implementations of =make=
1. GNU Make
1. =make -j16=
1. Cf. =and=, ..., =gradle=


* Example: TurnInSrc

1. =turnin= was a command line program used to turnin student
   submissions.

1. [[../TurnInSrc/]]
: -rw-rw-r--. 1 pmateti pmateti   734 May 18  201x Makefile
: -rw-rw-r--. 1 pmateti pmateti 21767 May 18  201x turnin
: -rw-rw-r--. 1 pmateti pmateti 11103 May 18  201x turnin.c
: -rw-rw-r--. 1 pmateti pmateti 23088 May 18  201x turnin.o

1. Study the Makefile
1. Study Effective UserID


* References

1. {Lecture Notes from UWash CSE 391: System and Software Tools,
   Spring 2017 [[https://courses.cs.washington.edu/courses/cse391/17sp/lectures/8/391Lecture08_17sp.ppt][Build Tools: make and ant]]} Recommended Reading.

* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
