Courses/4420/Lectures/Refreshers/Makefile/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Refresher on Makefiles</title>
<!-- 2018-12-03 Mon 12:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href=./>NoSlides</a>
</div>
<div id="content">
<h1 class="title">Refresher on Makefiles</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Targeted Goal</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="./Makefile-linux-4.20">./Makefile-linux-4.20</a>  for Linux Kernel + Modules
</li>
<li><a href="./Makefile-selinux-devel-include">./Makefile-selinux-devel-include</a> for building a SELinux .pp 
</li>
<li>Understand the two examples above "quite well"
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What is in a Makefile?</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Dependencies
</li>
<li>String Definitions
</li>
<li>Shell Commands
</li>
<li>Example Makefile for the above:  <a href="../TurnInSrc/Makefile">../TurnInSrc/Makefile</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Practical Details</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Different design/implementations of <code>make</code>
</li>
<li>GNU Make
</li>
<li><code>make -j16</code>
</li>
<li>Cf. <code>and</code>, &#x2026;, <code>gradle</code>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Example: TurnInSrc</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><code>turnin</code> was a command line program used to turnin student
submissions.
</li>

<li><a href="../TurnInSrc/">../TurnInSrc/</a>
</li>
</ol>
<pre class="example">
-rw-rw-r--. 1 pmateti pmateti   734 May 18  201x Makefile
-rw-rw-r--. 1 pmateti pmateti 21767 May 18  201x turnin
-rw-rw-r--. 1 pmateti pmateti 11103 May 18  201x turnin.c
-rw-rw-r--. 1 pmateti pmateti 23088 May 18  201x turnin.o
</pre>

<ol class="org-ol">
<li>Study the Makefile
</li>
<li>Study Effective UserID
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>{Lecture Notes from UWash CSE 391: System and Software Tools,
Spring 2017 <a href="https://courses.cs.washington.edu/courses/cse391/17sp/lectures/8/391Lecture08_17sp.ppt">Build Tools: make and ant</a>} Recommended Reading.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-12-03
</div>
</body>
</html>
